In [1]:
import pandas as pd
India_weather= pd.DataFrame({
    "city":['Bangalore','Mumbai','Delhi'],
    "temperature":[30,37,40],
    "humidity":[55,70,45]
})
India_weather

        city  temperature  humidity
0  Bangalore           30        55
1     Mumbai           37        70
2      Delhi           40        45

In [2]:
europe_weather= pd.DataFrame({
    "city":['london','paris','netherlands'],
    "temperature":[20,18,21],
    "humidity":[22,23,17]
})
europe_weather

          city  temperature  humidity
0       london           20        22
1        paris           18        23
2  netherlands           21        17

In [3]:
df=pd.concat([India_weather,europe_weather])
df

          city  temperature  humidity
0    Bangalore           30        55
1       Mumbai           37        70
2        Delhi           40        45
0       london           20        22
1        paris           18        23
2  netherlands           21        17

In [4]:
df=pd.concat([India_weather,europe_weather],ignore_index=True)
df

          city  temperature  humidity
0    Bangalore           30        55
1       Mumbai           37        70
2        Delhi           40        45
3       london           20        22
4        paris           18        23
5  netherlands           21        17

In [6]:
df=pd.concat([India_weather,europe_weather],keys=["India","europe"])
df

                 city  temperature  humidity
India  0    Bangalore           30        55
       1       Mumbai           37        70
       2        Delhi           40        45
europe 0       london           20        22
       1        paris           18        23
       2  netherlands           21        17

In [9]:
df.loc["europe"]

          city  temperature  humidity
0       london           20        22
1        paris           18        23
2  netherlands           21        17

In [15]:
temperature=pd.DataFrame({
    "city":['Bangalore','Mumbai','Delhi'],
    "temperature":[30,37,40]
}, index=[0,1,2])
temperature

        city  temperature
0  Bangalore           30
1     Mumbai           37
2      Delhi           40

In [16]:
humidity =pd.DataFrame({
    "city":['Delhi','Bangalore'],
    "humidity":[55,45]
},index=[2,0])
humidity

        city  humidity
2      Delhi        55
0  Bangalore        45

In [17]:
df=pd.concat([temperature,humidity],axis=1)
df

        city  temperature       city  humidity
0  Bangalore           30  Bangalore      45.0
1     Mumbai           37        NaN       NaN
2      Delhi           40      Delhi      55.0

In [18]:
temperature

        city  temperature
0  Bangalore           30
1     Mumbai           37
2      Delhi           40

In [20]:
s=pd.Series(["rain","sunny","foggy"],name="event")
s

0     rain
1    sunny
2    foggy
Name: event, dtype: object

In [23]:
df= pd.concat([temperature,s],axis=1)
df

        city  temperature  event
0  Bangalore           30   rain
1     Mumbai           37  sunny
2      Delhi           40  foggy

In [24]:
temperature=pd.DataFrame({
    "city":['Bangalore','Mumbai','Delhi'],
    "temperature":[30,37,40]
})
temperature

        city  temperature
0  Bangalore           30
1     Mumbai           37
2      Delhi           40

In [25]:
humidity =pd.DataFrame({
    "city":['Delhi','Bangalore','Mumbai'],
    "humidity":[55,45,70]
})
humidity

        city  humidity
0      Delhi        55
1  Bangalore        45
2     Mumbai        70

In [31]:
df=pd.merge(temperature,humidity,on='city')
df

        city  temperature  humidity
0  Bangalore           30        45
1     Mumbai           37        70
2      Delhi           40        55

In [32]:
temperature=pd.DataFrame({
    "city":['Bangalore','Mumbai','Delhi','jaipur'],
    "temperature":[30,37,40,50]
})
temperature

        city  temperature
0  Bangalore           30
1     Mumbai           37
2      Delhi           40
3     jaipur           50

In [33]:
humidity =pd.DataFrame({
    "city":['Delhi','Bangalore','chennai'],
    "humidity":[55,45,70]
})
humidity

        city  humidity
0      Delhi        55
1  Bangalore        45
2    chennai        70

In [35]:
df=pd.merge(temperature,humidity,on='city', how="outer")
df

        city  temperature  humidity
0  Bangalore         30.0      45.0
1     Mumbai         37.0       NaN
2      Delhi         40.0      55.0
3     jaipur         50.0       NaN
4    chennai          NaN      70.0

In [36]:
df=pd.merge(temperature,humidity,on='city', how="outer", indicator=True)
df

        city  temperature  humidity      _merge
0  Bangalore         30.0      45.0        both
1     Mumbai         37.0       NaN   left_only
2      Delhi         40.0      55.0        both
3     jaipur         50.0       NaN   left_only
4    chennai          NaN      70.0  right_only